main/Catalogs/Вакцины.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Catalog>
		<Properties>
			<Name>Вакцины</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВакциныПоКоличествуИнфекцийОтКоторыхОнаЗащищает</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СредняяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бесплатная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отечественная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Инфекции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Инфекция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Инфекции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

main/Enums/ТипыВакциныПоКоличествуИнфекцийОтКоторыхОниЗащищают.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Enum>
		<Properties>
			<Name>ТипыВакциныПоКоличествуИнфекцийОтКоторыхОниЗащищают</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Моновакцина</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поливакцина</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

main/Catalogs/Вакцины/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция СформироватьДанныеВакцин() Экспорт
	
	СписокВакцин = Новый Соответствие;
	
	#Область ИнфанриксГекса
	
	ДанныеВакцины = ПолучитьСтруктуруДанныхВакцин();
	ДанныеВакцины.Описание = НСтр("ru = 'является одной из самых современных, комбинированных вакцин'");
	ДанныеВакцины.ТипВакциныПоКоличествуИнфекцийОтКоторыхОнаЗащищает = Перечисления.ТипыВакциныПоКоличествуИнфекцийОтКоторыхОниЗащищают.Поливакцина;
	ДанныеВакцины.Отечественная = Ложь;
	ДанныеВакцины.Бесплатная = Ложь;
	ДанныеВакцины.СредняяСтоимость = 7500;
	
	ДанныеВакцины.Инфекции.Добавить(Справочники.Инфекции.ВирусныйГепатитВ);
	ДанныеВакцины.Инфекции.Добавить(Справочники.Инфекции.Столбняк);
	ДанныеВакцины.Инфекции.Добавить(Справочники.Инфекции.Дифтерия);
	ДанныеВакцины.Инфекции.Добавить(Справочники.Инфекции.Коклюш);
	ДанныеВакцины.Инфекции.Добавить(Справочники.Инфекции.Полиомиелит);
	ДанныеВакцины.Инфекции.Добавить(Справочники.Инфекции.ГемофильнаяИнфекция);
	
	СписокВакцин.Вставить(Справочники.Вакцины.ИнфанриксГекса, ДанныеВакцины);
	
	#КонецОбласти
	
	#Область РегевакВ
	
	ДанныеВакцины = ПолучитьСтруктуруДанныхВакцин();
	ДанныеВакцины.Описание = НСтр("ru = 'от вирусного гепатита В'");
	ДанныеВакцины.Бесплатная = Ложь;
	ДанныеВакцины.СредняяСтоимость = 2500;
	
	ДанныеВакцины.Инфекции.Добавить(Справочники.Инфекции.ВирусныйГепатитВ);
	
	СписокВакцин.Вставить(Справочники.Вакцины.РегевакВ, ДанныеВакцины);
	
	#КонецОбласти
	
	#Область ЭнджериксВ
	
	ДанныеВакцины = ПолучитьСтруктуруДанныхВакцин();
	ДанныеВакцины.Описание = НСтр("ru = 'от вирусного гепатита В'");
	ДанныеВакцины.Отечественная = Ложь;
	ДанныеВакцины.Бесплатная = Ложь;
	ДанныеВакцины.СредняяСтоимость = 2000;
	
	ДанныеВакцины.Инфекции.Добавить(Справочники.Инфекции.ВирусныйГепатитВ);
	
	СписокВакцин.Вставить(Справочники.Вакцины.ЭнджериксВ, ДанныеВакцины);
	
	#КонецОбласти
	
	Возврат СписокВакцин;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыФункции

Функция ПолучитьСтруктуруДанныхВакцин()
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Описание");
	СтруктураДанных.Вставить("ТипВакциныПоКоличествуИнфекцийОтКоторыхОнаЗащищает", Перечисления.ТипыВакциныПоКоличествуИнфекцийОтКоторыхОниЗащищают.Моновакцина);
	СтруктураДанных.Вставить("СредняяСтоимость");
	СтруктураДанных.Вставить("Бесплатная", Истина);
	СтруктураДанных.Вставить("Отечественная", Истина);
	СтруктураДанных.Вставить("Инфекции", Новый Массив);
	
	Возврат СтруктураДанных; 
	
КонецФункции

#КонецОбласти
